/*  _____                                                                             _____  */
/* ( ___ )                                                                           ( ___ ) */
/*  |   |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|   |  */
/*  |   |                                                                             |   |  */
/*  |   |                                                                             |   |  */
/*  |   |    _   _                       ____                  ____   ___  _ ____     |   |  */
/*  |   |   | | | | __ _ _ __ _ __ _   _|  _ \  ___  _ __ ___ |___ \ / _ \/ |___ \    |   |  */
/*  |   |   | |_| |/ _` | '__| '__| | | | | | |/ _ \| '_ ` _ \  __) | (_) | | __) |   |   |  */
/*  |   |   |  _  | (_| | |  | |  | |_| | |_| | (_) | | | | | |/ __/ \__, | |/ __/    |   |  */
/*  |   |   |_| |_|\__,_|_|  |_|   \__, |____/ \___/|_| |_| |_|_____|  /_/|_|_____|   |   |  */
/*  |   |                          |___/                                              |   |  */
/*  |   |                                                                             |   |  */
/*  |   |                                                                             |   |  */
/*  |___|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|___|  */
/* (_____)                                                                           (_____) */

/*-----PHIÊN BẢN NÂNG CẤP CỦA thuật toán tìm số fibonacci sử dụng đệ quy kết hợp quy hoạch động-----*/
/*-----UPDATE VERSION OF Search Fibonacci number algorithms using Recursion and Dynamic Programming-----*/

#include<bits/stdc++.h>

int arr[50] = {0};

int Fibonacci(int n){
    int f1 = arr[n - 1] ? arr[n - 1] : Fibonacci(n - 1);
    int f2 = arr[n - 2] ? arr[n - 2] : Fibonacci(n - 2);
    return arr[n] = f1 + f2;
}

int main(){
    arr[0] = arr[1] = 1;
    for(int i = 2; i < 20; i++){
        std::cout << Fibonacci(i) << " ";
    }
}